mod-bee/modbee-node-uio/lib/ModbeeNodeFW/src/ESP32Modbee.cpp
#include "ESP32Modbee.h"

// Optional debugging (uncomment to enable)
// #define debugf(...) Serial.printf(__VA_ARGS__)

ESP32Modbee::ESP32Modbee(
  uint8_t mode,
  uint8_t modbusRxPin,
  uint8_t modbusTxPin,
  uint8_t modbusId,
  uint8_t modbeeRxPin,
  uint8_t modbeeTxPin,
  uint8_t modbeeId,
  uint32_t baudrate1,
  uint32_t serialConfig1,
  uint32_t baudrate2,
  uint32_t serialConfig2
) : _mode(mode),
    _ledPin(LED_PIN),
    _sdaPin(37),
    _sclPin(38),
    _modbusRxPin(modbusRxPin),
    _modbusTxPin(modbusTxPin),
    _baudrate1(baudrate1),
    _serialConfig1(serialConfig1),
    _serialPort1(&Serial1),
    _modbeeID(modbeeId),
    _modbeeRxPin(modbeeRxPin),
    _modbeeTxPin(modbeeTxPin),
    _baudrate2(baudrate2),
    _serialConfig2(serialConfig2),
    _serialPort2(&Serial2),
    _ads(0x49, &Wire1),
    _dac(RESOLUTION_15_BIT, 0x5F, &Wire1),
    modbusID(modbusId),
    isMaster(mode == MB_MASTER),
    _adsInitialized(false),
    _dacInitialized(false),
    DI01(false),
    DI02(false),
    DI03(false),
    DI04(false),
    DI05(false),
    DI06(false),
    DI07(false),
    DI08(false),
    DO01(false),
    DO02(false),
    DO03(false),
    DO04(false),
    DO05(false),
    DO06(false),
    DO07(false),
    DO08(false),
    hatPower(false),
    AI01_Scaled(0),
    AI02_Scaled(0),
    AI03_Scaled(0),
    AI04_Scaled(0),
    AO01_Scaled(0),
    AO02_Scaled(0),
    mbeeTempDO01(false),
    mbeeTempDO02(false),
    mbeeTempDO03(false),
    mbeeTempDO04(false),
    mbeeTempDO05(false),
    mbeeTempDO06(false),
    mbeeTempDO07(false),
    mbeeTempDO08(false),
    mbeeTempAO01_Scaled(0),
    mbeeTempAO02_Scaled(0),
    mbeeTempAO01_Raw(0),
    mbeeTempAO02_Raw(0) {
  _adcModes[AI01] = MODE_VOLTAGE;
  _adcModes[AI02] = MODE_VOLTAGE;
  _adcModes[AI03] = MODE_VOLTAGE;
  _adcModes[AI04] = MODE_VOLTAGE;
  _dacModes[AO01] = MODE_VOLTAGE;
  _dacModes[AO02] = MODE_VOLTAGE;

  _calZeroOffsetADC[AI01] = 0;
  _calZeroOffsetADC[AI02] = 0;
  _calZeroOffsetADC[AI03] = 0;
  _calZeroOffsetADC[AI04] = 0;
  _calLowADC[AI01] = 0;
  _calLowADC[AI02] = 0;
  _calLowADC[AI03] = 0;
  _calLowADC[AI04] = 0;
  _calHighADC[AI01] = 32767;
  _calHighADC[AI02] = 32767;
  _calHighADC[AI03] = 32767;
  _calHighADC[AI04] = 32767;

  _calZeroOffsetDAC[AO01] = 0;
  _calZeroOffsetDAC[AO02] = 0;
  _calLowDAC[AO01] = 0;
  _calLowDAC[AO02] = 0;
  _calHighDAC[AO01] = 32767;
  _calHighDAC[AO02] = 32767;
}

void ESP32Modbee::begin() {
  // Initialize LED
  FastLED.addLeds<WS2812, LED_PIN, GRB>(_leds, 1);
  _leds[0] = CRGB::Green;
  _leds[0].fadeToBlackBy(DEFAULT_LED_BRIGHTNESS);
  FastLED.show();

  // Initialize I2C
  Wire1.begin(_sdaPin, _sclPin);

  // Initialize ADS1115 (gain=2 for ±2.048V, SINGLE SHOT mode for async, 128 sps)
  if (_ads.begin()) {
    _ads.setGain(2);
    _ads.setMode(1);        // SINGLE SHOT MODE for async operation
    _ads.setDataRate(5);
    _adsInitialized = true;
    
    // Start first async read
    _ads.requestADC(AI01);
  }

  // Initialize DAC (GP8413, 15-bit resolution, 10V range)
  if (_dac.begin() == 0) {
    _dac.setDACOutRange(_dac.eOutputRange10V);
    _dacInitialized = true;
  }

  // Initialize filesystem and load calibration
  _initLittleFS();
  _loadCalibration();

  // Initialize hatPower pin
  pinMode(_hatPowerPin, OUTPUT);
  digitalWrite(_hatPowerPin, LOW);

  // Initialize Modbus
  if (_mode == MB_MASTER || _mode == MB_SLAVE || _mode == MB_REMOTE_IO) {
    _serialPort1->begin(_baudrate1, _serialConfig1, _modbusRxPin, _modbusTxPin);
    mb.begin(_serialPort1);

    if (isMaster) {
      mb.master();
    } else {
      mb.slave(modbusID);

      // Initialize Coils
      mb.addCoil(mbDO01);
      mb.addCoil(mbDO02);
      mb.addCoil(mbDO03);
      mb.addCoil(mbDO04);
      mb.addCoil(mbDO05);
      mb.addCoil(mbDO06);
      mb.addCoil(mbDO07);
      mb.addCoil(mbDO08);

      // Initialize Input Status
      mb.addIsts(mbDI01);
      mb.addIsts(mbDI02);
      mb.addIsts(mbDI03);
      mb.addIsts(mbDI04);
      mb.addIsts(mbDI05);
      mb.addIsts(mbDI06);
      mb.addIsts(mbDI07);
      mb.addIsts(mbDI08);

      // Initialize Input Registers
      mb.addIreg(mbAI01_SCALED);
      mb.addIreg(mbAI02_SCALED);
      mb.addIreg(mbAI03_SCALED);
      mb.addIreg(mbAI04_SCALED);
      mb.addIreg(mbAI01_RAW);
      mb.addIreg(mbAI02_RAW);
      mb.addIreg(mbAI03_RAW);
      mb.addIreg(mbAI04_RAW);

      // Initialize Holding Registers (0-based)
      mb.addHreg(mbAO01_SCALED, AO01_Scaled);
      mb.addHreg(mbAO02_SCALED, AO02_Scaled);
      mb.addHreg(mbCAL_ZERO_OFFSET_ADC0, _calZeroOffsetADC[AI01]);
      mb.addHreg(mbCAL_ZERO_OFFSET_ADC1, _calZeroOffsetADC[AI02]);
      mb.addHreg(mbCAL_ZERO_OFFSET_ADC2, _calZeroOffsetADC[AI03]);
      mb.addHreg(mbCAL_ZERO_OFFSET_ADC3, _calZeroOffsetADC[AI04]);
      mb.addHreg(mbCAL_ZERO_OFFSET_DAC0, _calZeroOffsetDAC[AO01]);
      mb.addHreg(mbCAL_ZERO_OFFSET_DAC1, _calZeroOffsetDAC[AO02]);
      mb.addHreg(mbCAL_LOW_ADC0, _calLowADC[AI01]);
      mb.addHreg(mbCAL_LOW_ADC1, _calLowADC[AI02]);
      mb.addHreg(mbCAL_LOW_ADC2, _calLowADC[AI03]);
      mb.addHreg(mbCAL_LOW_ADC3, _calLowADC[AI04]);
      mb.addHreg(mbCAL_HIGH_ADC0, _calHighADC[AI01]);
      mb.addHreg(mbCAL_HIGH_ADC1, _calHighADC[AI02]);
      mb.addHreg(mbCAL_HIGH_ADC2, _calHighADC[AI03]);
      mb.addHreg(mbCAL_HIGH_ADC3, _calHighADC[AI04]);
      mb.addHreg(mbCAL_LOW_DAC0, _calLowDAC[AO01]);
      mb.addHreg(mbCAL_LOW_DAC1, _calLowDAC[AO02]);
      mb.addHreg(mbCAL_HIGH_DAC0, _calHighDAC[AO01]);
      mb.addHreg(mbCAL_HIGH_DAC1, _calHighDAC[AO02]);

      // Initialize Coils
      mb.Coil(mbDO01, 0);
      mb.Coil(mbDO02, 0);
      mb.Coil(mbDO03, 0);
      mb.Coil(mbDO04, 0);
      mb.Coil(mbDO05, 0);
      mb.Coil(mbDO06, 0);
      mb.Coil(mbDO07, 0);
      mb.Coil(mbDO08, 0);

      // Initialize Input Status
      mb.Ists(mbDI01, 0);
      mb.Ists(mbDI02, 0);
      mb.Ists(mbDI03, 0);
      mb.Ists(mbDI04, 0);
      mb.Ists(mbDI05, 0);
      mb.Ists(mbDI06, 0);
      mb.Ists(mbDI07, 0);
      mb.Ists(mbDI08, 0);

      // Initialize Input Registers
      mb.Ireg(mbAI01_SCALED, 0);
      mb.Ireg(mbAI02_SCALED, 0);
      mb.Ireg(mbAI03_SCALED, 0);
      mb.Ireg(mbAI04_SCALED, 0);
      mb.Ireg(mbAI01_RAW, 0);
      mb.Ireg(mbAI02_RAW, 0);
      mb.Ireg(mbAI03_RAW, 0);
      mb.Ireg(mbAI04_RAW, 0);

      // Initialize Holding Registers
      mb.Hreg(mbAO01_SCALED, 0);
      mb.Hreg(mbAO02_SCALED, 0);
    }
  }

  _serialPort2->begin(_baudrate2, _serialConfig2, _modbeeRxPin, _modbeeTxPin);

