mod-bee/modbee-node-uio/lib/ModbeeNodeFW/src/ESP32Modbee.cpp
  mbee.begin(_serialPort2, _modbeeID);

  // Map to temp variables to avoid conflicts - ModBee updates temps only
  mbee.addCoil(mbDO01, &mbeeTempDO01);
  mbee.addCoil(mbDO02, &mbeeTempDO02);
  mbee.addCoil(mbDO03, &mbeeTempDO03);
  mbee.addCoil(mbDO04, &mbeeTempDO04);
  mbee.addCoil(mbDO05, &mbeeTempDO05);
  mbee.addCoil(mbDO06, &mbeeTempDO06);
  mbee.addCoil(mbDO07, &mbeeTempDO07);
  mbee.addCoil(mbDO08, &mbeeTempDO08);
  // Digital inputs map to actual variables - remote can read them
  mbee.addIsts(mbDI01, &DI01);
  mbee.addIsts(mbDI02, &DI02);
  mbee.addIsts(mbDI03, &DI03);
  mbee.addIsts(mbDI04, &DI04);
  mbee.addIsts(mbDI05, &DI05);
  mbee.addIsts(mbDI06, &DI06);
  mbee.addIsts(mbDI07, &DI07);
  mbee.addIsts(mbDI08, &DI08);
  // Analog inputs map to actual variables - remote can read them
  mbee.addIreg(mbAI01_SCALED, &AI01_Scaled);
  mbee.addIreg(mbAI02_SCALED, &AI02_Scaled);
  mbee.addIreg(mbAI03_SCALED, &AI03_Scaled);
  mbee.addIreg(mbAI04_SCALED, &AI04_Scaled);
  mbee.addIreg(mbAI01_RAW, &AI01_Raw);
  mbee.addIreg(mbAI02_RAW, &AI02_Raw);
  mbee.addIreg(mbAI03_RAW, &AI03_Raw);
  mbee.addIreg(mbAI04_RAW, &AI04_Raw);
  // Map to temp variables for analog outputs - we read from remote instead
  mbee.addHreg(mbAO01_SCALED, &mbeeTempAO01_Scaled);
  mbee.addHreg(mbAO02_SCALED, &mbeeTempAO02_Scaled);
  mbee.addHreg(mbAO01_RAW, &mbeeTempAO01_Raw);
  mbee.addHreg(mbAO02_RAW, &mbeeTempAO02_Raw);

  // --- Calibration registers ---
  mbee.addHreg(mbCAL_ZERO_OFFSET_ADC0, &_calZeroOffsetADC[AI01]);
  mbee.addHreg(mbCAL_ZERO_OFFSET_ADC1, &_calZeroOffsetADC[AI02]);
  mbee.addHreg(mbCAL_ZERO_OFFSET_ADC2, &_calZeroOffsetADC[AI03]);
  mbee.addHreg(mbCAL_ZERO_OFFSET_ADC3, &_calZeroOffsetADC[AI04]);
  mbee.addHreg(mbCAL_ZERO_OFFSET_DAC0, &_calZeroOffsetDAC[AO01]);
  mbee.addHreg(mbCAL_ZERO_OFFSET_DAC1, &_calZeroOffsetDAC[AO02]);

  mbee.addHreg(mbCAL_LOW_ADC0, &_calLowADC[AI01]);
  mbee.addHreg(mbCAL_LOW_ADC1, &_calLowADC[AI02]);
  mbee.addHreg(mbCAL_LOW_ADC2, &_calLowADC[AI03]);
  mbee.addHreg(mbCAL_LOW_ADC3, &_calLowADC[AI04]);

  mbee.addHreg(mbCAL_HIGH_ADC0, &_calHighADC[AI01]);
  mbee.addHreg(mbCAL_HIGH_ADC1, &_calHighADC[AI02]);
  mbee.addHreg(mbCAL_HIGH_ADC2, &_calHighADC[AI03]);
  mbee.addHreg(mbCAL_HIGH_ADC3, &_calHighADC[AI04]);

  mbee.addHreg(mbCAL_LOW_DAC0, &_calLowDAC[AO01]);
  mbee.addHreg(mbCAL_LOW_DAC1, &_calLowDAC[AO02]);

  mbee.addHreg(mbCAL_HIGH_DAC0, &_calHighDAC[AO01]);
  mbee.addHreg(mbCAL_HIGH_DAC1, &_calHighDAC[AO02]);

  // Initialize digital I/O pins
  for (uint8_t i = 0; i < 8; i++) {
    pinMode(_digitalInputPins[i], INPUT);
    pinMode(_digitalOutputPins[i], OUTPUT);
    digitalWrite(_digitalOutputPins[i], LOW);
  }
}

void ESP32Modbee::update() {
  if (_mode == MB_MASTER || _mode == MB_SLAVE || _mode == MB_REMOTE_IO) {
    mb.task();
  }

  // Modbee Protocol
  mbee.loop();

  // Digital Inputs
  DI01 = digitalRead(_digitalInputPins[0]);
  DI02 = digitalRead(_digitalInputPins[1]);
  DI03 = digitalRead(_digitalInputPins[2]);
  DI04 = digitalRead(_digitalInputPins[3]);
  DI05 = digitalRead(_digitalInputPins[4]);
  DI06 = digitalRead(_digitalInputPins[5]);
  DI07 = digitalRead(_digitalInputPins[6]);
  DI08 = digitalRead(_digitalInputPins[7]);

  if (_mode == MB_REMOTE_IO) {
    mb.Ists(mbDI01, DI01);
    mb.Ists(mbDI02, DI02);
    mb.Ists(mbDI03, DI03);
    mb.Ists(mbDI04, DI04);
    mb.Ists(mbDI05, DI05);
    mb.Ists(mbDI06, DI06);
    mb.Ists(mbDI07, DI07);
    mb.Ists(mbDI08, DI08);
  }
  // Note: MBEE_REMOTE_IO handles input writes via modbee.loop() and mapped variables
  // No additional write needed here - ModBee library manages it

  // Digital Outputs
  bool tempDO01, tempDO02, tempDO03, tempDO04, tempDO05, tempDO06, tempDO07, tempDO08;
  if (_mode == MB_REMOTE_IO) {
    tempDO01 = mb.Coil(mbDO01);
    tempDO02 = mb.Coil(mbDO02);
    tempDO03 = mb.Coil(mbDO03);
    tempDO04 = mb.Coil(mbDO04);
    tempDO05 = mb.Coil(mbDO05);
    tempDO06 = mb.Coil(mbDO06);
    tempDO07 = mb.Coil(mbDO07);
    tempDO08 = mb.Coil(mbDO08);
  } else if (_mode == MBEE_REMOTE_IO) {
    // Use mapped temp variables (automatically updated by ModBee when remote writes)
    tempDO01 = mbeeTempDO01;
    tempDO02 = mbeeTempDO02;
    tempDO03 = mbeeTempDO03;
    tempDO04 = mbeeTempDO04;
    tempDO05 = mbeeTempDO05;
    tempDO06 = mbeeTempDO06;
    tempDO07 = mbeeTempDO07;
    tempDO08 = mbeeTempDO08;
  } else {
    // User mode: use direct local variables
    tempDO01 = DO01;
    tempDO02 = DO02;
    tempDO03 = DO03;
    tempDO04 = DO04;
    tempDO05 = DO05;
    tempDO06 = DO06;
    tempDO07 = DO07;
    tempDO08 = DO08;
  }
    
  digitalWrite(_digitalOutputPins[0], tempDO01);
  digitalWrite(_digitalOutputPins[1], tempDO02);
  digitalWrite(_digitalOutputPins[2], tempDO03);
  digitalWrite(_digitalOutputPins[3], tempDO04);
  digitalWrite(_digitalOutputPins[4], tempDO05);
  digitalWrite(_digitalOutputPins[5], tempDO06);
  digitalWrite(_digitalOutputPins[6], tempDO07);
  digitalWrite(_digitalOutputPins[7], tempDO08);

  // Hat Power Output
  // IMPORTANT: Hat power is LOCAL-ONLY (not controllable via Modbus/ModBee).
  digitalWrite(_hatPowerPin, hatPower);

  // Analog Inputs - ASYNC WITH TIMER
  if (_adsInitialized) {
    static unsigned long lastADCCheck = 0;
    
    // Only check ADC every 10ms
    if (millis() - lastADCCheck >= 5) {
      
      if (_ads.isReady()) {
        // Get the result from previous request
        int16_t rawValue = _ads.getValue();
        
        // Process based on current channel
        switch (_currentADCChannel) {
          case AI01:
            AI01_Raw = rawValue;
            if (rawValue < 0) rawValue = 0;
            AI01_Scaled = _scaleADC(AI01, rawValue);
            if (_mode == MB_REMOTE_IO) {
              mb.Ireg(mbAI01_SCALED, AI01_Scaled);
              mb.Ireg(mbAI01_RAW, rawValue);
            }
            break;
            
          case AI02:
            AI02_Raw = rawValue;
            if (rawValue < 0) rawValue = 0;
            AI02_Scaled = _scaleADC(AI02, rawValue);
            if (_mode == MB_REMOTE_IO) {
              mb.Ireg(mbAI02_SCALED, AI02_Scaled);
              mb.Ireg(mbAI02_RAW, rawValue);
            }
            break;
            
          case AI03:
            AI03_Raw = rawValue;
            if (rawValue < 0) rawValue = 0;
            AI03_Scaled = _scaleADC(AI03, rawValue);
            if (_mode == MB_REMOTE_IO) {
              mb.Ireg(mbAI03_SCALED, AI03_Scaled);
              mb.Ireg(mbAI03_RAW, rawValue);
            }
            break;
            
          case AI04:
            AI04_Raw = rawValue;
            if (rawValue < 0) rawValue = 0;
            AI04_Scaled = _scaleADC(AI04, rawValue);
            if (_mode == MB_REMOTE_IO) {
              mb.Ireg(mbAI04_SCALED, AI04_Scaled);
              mb.Ireg(mbAI04_RAW, rawValue);
            }
            break;
        }
        
        // Move to next channel
        _currentADCChannel++;
        if (_currentADCChannel > AI04) {
          _currentADCChannel = AI01;
        }
        
