mod-bee/modbee-node-uio/lib/ModbeeNodeFW/src/ESP32Modbee.cpp
        // Start next async read
        _ads.requestADC(_currentADCChannel);
      }
      
      lastADCCheck = millis();
    }
  }

  // Analog Outputs
  int16_t tempAO01_Scaled, tempAO02_Scaled, tempAO01_Raw, tempAO02_Raw;
  if (_mode == MB_REMOTE_IO) {
    tempAO01_Scaled = mb.Hreg(mbAO01_SCALED);
    tempAO02_Scaled = mb.Hreg(mbAO02_SCALED);
    tempAO01_Raw = mb.Hreg(mbAO01_RAW);
    tempAO02_Raw = mb.Hreg(mbAO02_RAW);
  } else if (_mode == MBEE_REMOTE_IO) {
    // Use mapped temp variables (automatically updated by ModBee when remote writes)
    tempAO01_Scaled = mbeeTempAO01_Scaled;
    tempAO02_Scaled = mbeeTempAO02_Scaled;
    tempAO01_Raw = mbeeTempAO01_Raw;
    tempAO02_Raw = mbeeTempAO02_Raw;
  } else {
    // User mode: use direct local variables
    tempAO01_Scaled = AO01_Scaled;
    tempAO02_Scaled = AO02_Scaled;
    tempAO01_Raw = AO01_Raw;
    tempAO02_Raw = AO02_Raw;
  }
  if (_dacInitialized) {
    // If tempAO01_Scaled changed, update tempAO01_Raw and DAC
    int16_t new_ao01_raw = _scaleDAC(AO01, tempAO01_Scaled);
    if (new_ao01_raw != tempAO01_Raw) {
      tempAO01_Raw = new_ao01_raw;
      _dac.setDACOutVoltage(tempAO01_Raw, 0);
    }
    // If tempAO01_Raw changed (e.g. via Modbus), update tempAO01_Scaled and DAC
    int16_t new_ao01_scaled = tempAO01_Scaled;
    if (tempAO01_Raw != _scaleDAC(AO01, tempAO01_Scaled)) {
      new_ao01_scaled = _inverseScaleDAC(AO01, tempAO01_Raw);
      tempAO01_Scaled = new_ao01_scaled;
      _dac.setDACOutVoltage(tempAO01_Raw, 0);
    }

    int16_t new_ao02_raw = _scaleDAC(AO02, tempAO02_Scaled);
    if (new_ao02_raw != tempAO02_Raw) {
      tempAO02_Raw = new_ao02_raw;
      _dac.setDACOutVoltage(tempAO02_Raw, 1);
    }
    int16_t new_ao02_scaled = tempAO02_Scaled;
    if (tempAO02_Raw != _scaleDAC(AO02, tempAO02_Scaled)) {
      new_ao02_scaled = _inverseScaleDAC(AO02, tempAO02_Raw);
      tempAO02_Scaled = new_ao02_scaled;
      _dac.setDACOutVoltage(tempAO02_Raw, 1);
    }
  }

  // Calibration Sync
  static int16_t lastCalZeroOffsetADC[4], lastCalLowADC[4], lastCalHighADC[4];
  static int16_t lastCalZeroOffsetDAC[2], lastCalLowDAC[2], lastCalHighDAC[2];
  static unsigned long lastSave = 0;
  if ((_mode == MB_SLAVE || _mode == MB_REMOTE_IO) && millis() - lastSave >= 1000) {
    bool changed = false;

    // ADC Calibration
    const HoldingReg adcZeroOffsets[] = {
      mbCAL_ZERO_OFFSET_ADC0,
      mbCAL_ZERO_OFFSET_ADC1,
      mbCAL_ZERO_OFFSET_ADC2,
      mbCAL_ZERO_OFFSET_ADC3
    };
    const HoldingReg adcLows[] = {
      mbCAL_LOW_ADC0,
      mbCAL_LOW_ADC1,
      mbCAL_LOW_ADC2,
      mbCAL_LOW_ADC3
    };
    const HoldingReg adcHighs[] = {
      mbCAL_HIGH_ADC0,
      mbCAL_HIGH_ADC1,
      mbCAL_HIGH_ADC2,
      mbCAL_HIGH_ADC3
    };
    const AnalogInputChannel adcChannels[] = {AI01, AI02, AI03, AI04};

    for (uint8_t i = 0; i < 4; i++) {
      AnalogInputChannel ch = adcChannels[i];
      int16_t regZeroOffset = mb.Hreg(adcZeroOffsets[i]);
      if (_calZeroOffsetADC[ch] != regZeroOffset) {
        _calZeroOffsetADC[ch] = regZeroOffset;
        changed = true;
      }
      int16_t regLow = mb.Hreg(adcLows[i]);
      if (_calLowADC[ch] != regLow) {
        _calLowADC[ch] = regLow;
        changed = true;
      }
      int16_t regHigh = mb.Hreg(adcHighs[i]);
      if (_calHighADC[ch] != regHigh) {
        _calHighADC[ch] = regHigh;
        changed = true;
      }
      if (_calZeroOffsetADC[ch] != lastCalZeroOffsetADC[ch] ||
          _calLowADC[ch] != lastCalLowADC[ch] ||
          _calHighADC[ch] != lastCalHighADC[ch]) {
        changed = true;
        lastCalZeroOffsetADC[ch] = _calZeroOffsetADC[ch];
        lastCalLowADC[ch] = _calLowADC[ch];
        lastCalHighADC[ch] = _calHighADC[ch];
      }
    }

    // DAC Calibration
    const HoldingReg dacZeroOffsets[] = {
      mbCAL_ZERO_OFFSET_DAC0,
      mbCAL_ZERO_OFFSET_DAC1
    };
    const HoldingReg dacLows[] = {
      mbCAL_LOW_DAC0,
      mbCAL_LOW_DAC1
    };
    const HoldingReg dacHighs[] = {
      mbCAL_HIGH_DAC0,
      mbCAL_HIGH_DAC1
    };
    const AnalogOutputChannel dacChannels[] = {AO01, AO02};

    for (uint8_t i = 0; i < 2; i++) {
      AnalogOutputChannel ch = dacChannels[i];
      int16_t regZeroOffset = mb.Hreg(dacZeroOffsets[i]);
      if (_calZeroOffsetDAC[ch] != regZeroOffset) {
        _calZeroOffsetDAC[ch] = regZeroOffset;
        changed = true;
      }
      int16_t regLow = mb.Hreg(dacLows[i]);
      if (_calLowDAC[ch] != regLow) {
        _calLowDAC[ch] = regLow;
        changed = true;
      }
      int16_t regHigh = mb.Hreg(dacHighs[i]);
      if (_calHighDAC[ch] != regHigh) {
        _calHighDAC[ch] = regHigh;
        changed = true;
      }
      if (_calZeroOffsetDAC[ch] != lastCalZeroOffsetDAC[ch] ||
          _calLowDAC[ch] != lastCalLowDAC[ch] ||
          _calHighDAC[ch] != lastCalHighDAC[ch]) {
        changed = true;
        lastCalZeroOffsetDAC[ch] = _calZeroOffsetDAC[ch];
        lastCalLowDAC[ch] = _calLowDAC[ch];
        lastCalHighDAC[ch] = _calHighDAC[ch];
      }
    }

    if (changed) {
      _saveCalibration();
      lastSave = millis();
    }
  }
}

void ESP32Modbee::setADCMode(uint8_t channel, AnalogMode mode) {
  if (channel < 4) {
    _adcModes[channel] = mode;
  }
}

void ESP32Modbee::setDACMode(uint8_t channel, AnalogMode mode) {
  if (channel < 2) {
    _dacModes[channel] = mode;
  }
}

void ESP32Modbee::_initLittleFS() {
  if (!LittleFS.begin(true)) {
    // debugf("LittleFS init failed\n");
    LittleFS.begin(true);
  }
}

void ESP32Modbee::_loadCalibration() {
  File file = LittleFS.open(SETTINGS_FILE, "r");
  if (file) {
    DeserializationError error = deserializeJson(_calibrationDoc, file);
    if (!error && _calibrationDoc.is<JsonObject>()) {
      // Check if keys exist and are arrays
      if (_calibrationDoc["adc_zero_offsets"].is<JsonArray>()) {
        JsonArray adcZeroOffsets = _calibrationDoc["adc_zero_offsets"].as<JsonArray>();
        for (uint8_t i = 0; i < 4 && i < adcZeroOffsets.size(); i++) {
          _calZeroOffsetADC[i] = adcZeroOffsets[i].as<int16_t>();
        }
      }
      if (_calibrationDoc["adc_low"].is<JsonArray>()) {
        JsonArray adcLow = _calibrationDoc["adc_low"].as<JsonArray>();
        for (uint8_t i = 0; i < 4 && i < adcLow.size(); i++) {
          _calLowADC[i] = adcLow[i].as<int16_t>();
        }
      }
      if (_calibrationDoc["adc_high"].is<JsonArray>()) {
        JsonArray adcHigh = _calibrationDoc["adc_high"].as<JsonArray>();
        for (uint8_t i = 0; i < 4 && i < adcHigh.size(); i++) {
          _calHighADC[i] = adcHigh[i].as<int16_t>();
        }
      }
      if (_calibrationDoc["dac_zero_offsets"].is<JsonArray>()) {
        JsonArray dacZeroOffsets = _calibrationDoc["dac_zero_offsets"].as<JsonArray>();
        for (uint8_t i = 0; i < 2 && i < dacZeroOffsets.size(); i++) {
          _calZeroOffsetDAC[i] = dacZeroOffsets[i].as<int16_t>();
        }
      }
      if (_calibrationDoc["dac_low"].is<JsonArray>()) {
        JsonArray dacLow = _calibrationDoc["dac_low"].as<JsonArray>();
        for (uint8_t i = 0; i < 2 && i < dacLow.size(); i++) {
          _calLowDAC[i] = dacLow[i].as<int16_t>();
        }
      }
      if (_calibrationDoc["dac_high"].is<JsonArray>()) {
        JsonArray dacHigh = _calibrationDoc["dac_high"].as<JsonArray>();
        for (uint8_t i = 0; i < 2 && i < dacHigh.size(); i++) {
          _calHighDAC[i] = dacHigh[i].as<int16_t>();
        }
      }
    } else {
      _calibrationDoc.clear();
      JsonArray adcZeroOffsets = _calibrationDoc["adc_zero_offsets"].to<JsonArray>();
      JsonArray dacZeroOffsets = _calibrationDoc["dac_zero_offsets"].to<JsonArray>();
      JsonArray adcLow = _calibrationDoc["adc_low"].to<JsonArray>();
      JsonArray adcHigh = _calibrationDoc["adc_high"].to<JsonArray>();
      JsonArray dacLow = _calibrationDoc["dac_low"].to<JsonArray>();
      JsonArray dacHigh = _calibrationDoc["dac_high"].to<JsonArray>();
      for (uint8_t i = 0; i < 4; i++) {
        adcZeroOffsets.add(0);
        adcLow.add(0);
        adcHigh.add(32767);
        _calZeroOffsetADC[i] = 0;
        _calLowADC[i] = 0;
        _calHighADC[i] = 32767;
      }
      for (uint8_t i = 0; i < 2; i++) {
        dacZeroOffsets.add(0);
        dacLow.add(0);
        dacHigh.add(32767);
        _calZeroOffsetDAC[i] = 0;
        _calLowDAC[i] = 0;
        _calHighDAC[i] = 32767;
      }
      File writeFile = LittleFS.open(SETTINGS_FILE, "w");
      if (writeFile) {
        serializeJson(_calibrationDoc, writeFile);
        writeFile.close();
      } else {
        // debugf("Failed to write default config.json\n");
      }
    }
    file.close();
  } else {
    // File doesn't exist, initialize defaults
    _calibrationDoc.clear();
    JsonArray adcZeroOffsets = _calibrationDoc["adc_zero_offsets"].to<JsonArray>();
    JsonArray dacZeroOffsets = _calibrationDoc["dac_zero_offsets"].to<JsonArray>();
    JsonArray adcLow = _calibrationDoc["adc_low"].to<JsonArray>();
    JsonArray adcHigh = _calibrationDoc["adc_high"].to<JsonArray>();
    JsonArray dacLow = _calibrationDoc["dac_low"].to<JsonArray>();
    JsonArray dacHigh = _calibrationDoc["dac_high"].to<JsonArray>();
    for (uint8_t i = 0; i < 4; i++) {
      adcZeroOffsets.add(0);
      adcLow.add(0);
      adcHigh.add(32767);
      _calZeroOffsetADC[i] = 0;
      _calLowADC[i] = 0;
      _calHighADC[i] = 32767;
    }
    for (uint8_t i = 0; i < 2; i++) {
      dacZeroOffsets.add(0);
      dacLow.add(0);
      dacHigh.add(32767);
      _calZeroOffsetDAC[i] = 0;
      _calLowDAC[i] = 0;
      _calHighDAC[i] = 32767;
    }
    File writeFile = LittleFS.open(SETTINGS_FILE, "w");
    if (writeFile) {
      serializeJson(_calibrationDoc, writeFile);
      writeFile.close();
    } else {
      // debugf("Failed to create config.json\n");
    }
  }
}

void ESP32Modbee::_resetCalibration() {
  _calibrationDoc.clear();
  JsonArray adcZeroOffsets = _calibrationDoc["adc_zero_offsets"].to<JsonArray>();
  JsonArray dacZeroOffsets = _calibrationDoc["dac_zero_offsets"].to<JsonArray>();
  JsonArray adcLow = _calibrationDoc["adc_low"].to<JsonArray>();
  JsonArray adcHigh = _calibrationDoc["adc_high"].to<JsonArray>();
  JsonArray dacLow = _calibrationDoc["dac_low"].to<JsonArray>();
  JsonArray dacHigh = _calibrationDoc["dac_high"].to<JsonArray>();

  adcZeroOffsets.add(0);
  adcZeroOffsets.add(0);
  adcZeroOffsets.add(0);
  adcZeroOffsets.add(0);
  adcLow.add(0);
  adcLow.add(0);
  adcLow.add(0);
  adcLow.add(0);
  adcHigh.add(32767);
  adcHigh.add(32767);
  adcHigh.add(32767);
  adcHigh.add(32767);

  dacZeroOffsets.add(0);
  dacZeroOffsets.add(0);
  dacLow.add(0);
  dacLow.add(0);
  dacHigh.add(32767);
  dacHigh.add(32767);

  _calZeroOffsetADC[AI01] = 0;
  _calZeroOffsetADC[AI02] = 0;
  _calZeroOffsetADC[AI03] = 0;
  _calZeroOffsetADC[AI04] = 0;
  _calLowADC[AI01] = 0;
  _calLowADC[AI02] = 0;
  _calLowADC[AI03] = 0;
  _calLowADC[AI04] = 0;
  _calHighADC[AI01] = 32767;
  _calHighADC[AI02] = 32767;
  _calHighADC[AI03] = 32767;
  _calHighADC[AI04] = 32767;

  _calZeroOffsetDAC[AO01] = 0;
  _calZeroOffsetDAC[AO02] = 0;
  _calLowDAC[AO01] = 0;
  _calLowDAC[AO02] = 0;
  _calHighDAC[AO01] = 32767;
  _calHighDAC[AO02] = 32767;

