mod-bee/modbee-node-uio/lib/ModbeeNodeFW/src/ESP32Modbee.cpp
  File file = LittleFS.open(SETTINGS_FILE, "w");
  if (file) {
    serializeJson(_calibrationDoc, file);
    file.close();
    // debugf("Reset calibration saved to config.json\n");
  } else {
    // debugf("Failed to write reset config.json\n");
  }
}

void ESP32Modbee::_saveCalibration() {
  _calibrationDoc.clear();
  JsonArray adcZeroOffsets = _calibrationDoc["adc_zero_offsets"].to<JsonArray>();
  JsonArray dacZeroOffsets = _calibrationDoc["dac_zero_offsets"].to<JsonArray>();
  JsonArray adcLow = _calibrationDoc["adc_low"].to<JsonArray>();
  JsonArray adcHigh = _calibrationDoc["adc_high"].to<JsonArray>();
  JsonArray dacLow = _calibrationDoc["dac_low"].to<JsonArray>();
  JsonArray dacHigh = _calibrationDoc["dac_high"].to<JsonArray>();

  adcZeroOffsets.add(_calZeroOffsetADC[AI01]);
  adcZeroOffsets.add(_calZeroOffsetADC[AI02]);
  adcZeroOffsets.add(_calZeroOffsetADC[AI03]);
  adcZeroOffsets.add(_calZeroOffsetADC[AI04]);

  adcLow.add(_calLowADC[AI01]);
  adcLow.add(_calLowADC[AI02]);
  adcLow.add(_calLowADC[AI03]);
  adcLow.add(_calLowADC[AI04]);

  adcHigh.add(_calHighADC[AI01]);
  adcHigh.add(_calHighADC[AI02]);
  adcHigh.add(_calHighADC[AI03]);
  adcHigh.add(_calHighADC[AI04]);

  dacZeroOffsets.add(_calZeroOffsetDAC[AO01]);
  dacZeroOffsets.add(_calZeroOffsetDAC[AO02]);

  dacLow.add(_calLowDAC[AO01]);
  dacLow.add(_calLowDAC[AO02]);

  dacHigh.add(_calHighDAC[AO01]);
  dacHigh.add(_calHighDAC[AO02]);

  File file = LittleFS.open(SETTINGS_FILE, "w");
  if (file) {
    serializeJson(_calibrationDoc, file);
    file.close();
    // debugf("Calibration saved: ADC Low[1]=%d, DAC High[0]=%d\n", _calLowADC[AI02], _calHighDAC[AO01]);
  } else {
    // debugf("Failed to write config.json\n");
  }
}

int16_t ESP32Modbee::_scaleADC(uint8_t channel, int16_t adcValue) {
  // channel: 0=AI01, 1=AI02, 2=AI03, 3=AI04
  int32_t outLow = 0;
  int32_t outHigh = _adcModes[channel];
  int32_t rawLow = _calLowADC[channel];
  int32_t rawHigh = _calHighADC[channel];

  if (rawHigh == rawLow) {
    int32_t scaled = (int32_t)adcValue * _adcModes[channel] / 32767;
    scaled += _calZeroOffsetADC[channel];
    if (scaled < 0) scaled = 0;
    if (scaled > _adcModes[channel]) scaled = _adcModes[channel];
    return (int16_t)scaled;
  }

  int32_t scaled = outLow + (int64_t)(adcValue - rawLow) * (outHigh - outLow) / (rawHigh - rawLow);
  scaled += _calZeroOffsetADC[channel];
  if (scaled < 0) scaled = 0;
  if (scaled > _adcModes[channel]) scaled = _adcModes[channel];
  return (int16_t)scaled;
}

int16_t ESP32Modbee::_scaleDAC(uint8_t channel, int16_t value) {
  // channel: 0=AO01, 1=AO02
  int32_t outLow = 0;
  int32_t outHigh = _dacModes[channel];
  int32_t rawLow = _calLowDAC[channel];
  int32_t rawHigh = _calHighDAC[channel];

  if (rawHigh == rawLow) {
    int32_t adjusted = (int32_t)value + _calZeroOffsetDAC[channel];
    if (adjusted < 0) adjusted = 0;
    if (adjusted > _dacModes[channel]) adjusted = _dacModes[channel];
    uint16_t raw = (uint16_t)((adjusted * 32767) / _dacModes[channel]);
    return raw;
  }

  int32_t raw = rawLow + (int64_t)(value - outLow) * (rawHigh - rawLow) / (outHigh - outLow);
  raw += _calZeroOffsetDAC[channel];
  if (raw < 0) raw = 0;
  if (raw > 32767) raw = 32767;
  return (uint16_t)raw;
}

int16_t ESP32Modbee::_inverseScaleDAC(uint8_t channel, int16_t rawValue) {
  // Implement the inverse of _scaleDAC here
  int32_t outLow = 0;
  int32_t outHigh = _dacModes[channel];
  int32_t rawLow = _calLowDAC[channel];
  int32_t rawHigh = _calHighDAC[channel];

  if (rawHigh == rawLow) {
    int32_t scaled = (int32_t)rawValue * outHigh / 32767;
    scaled -= _calZeroOffsetDAC[channel];
    if (scaled < 0) scaled = 0;
    if (scaled > outHigh) scaled = outHigh;
    return (int16_t)scaled;
  }

  int32_t scaled = outLow + (int64_t)(rawValue - rawLow) * (outHigh - outLow) / (rawHigh - rawLow);
  scaled -= _calZeroOffsetDAC[channel];
  if (scaled < 0) scaled = 0;
  if (scaled > outHigh) scaled = outHigh;
  return (int16_t)scaled;
}